KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПоступлениеДСПоГосконтракту/КАНАТ_ПоступлениеДСПоГосконтракту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ПоступлениеДСПоГосконтракту</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="59afd471-d060-43ed-bc09-86b5b5a4a65b">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b8035e62-52e0-4355-84d9-d94eb6a26ede">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2e0a18f5-6ad1-45e9-95a8-f10e597efa5c">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="592bf0ba-feb4-4dc0-ae2e-d417e510e025">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d4822dd8-1037-4c98-9be7-a73bb03d013a">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d7783d31-f359-4bce-bf82-8a31afa21d5d">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетНаОплатуКлиенту/СчетНаОплатуКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7deae7a3-c5c6-4e3a-8a69-ee8c92e40c9a">
  <name>СчетНаОплатуКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38171f51-f270-4a82-a089-b63c611c4f1e">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Товары</name>
    <comment>Задача 000000222</comment>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <comment>Из объекта ДокументОснование</comment>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеревозчикПартнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружатьЧастями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОснования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_ПлатитЗаДоставку</name>
      <type>
        <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ГосударственныеКонтракты/ГосударственныеКонтракты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="150b7e79-b2ba-4802-8c98-0fb39df77a4a">
  <name>ГосударственныеКонтракты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44f46d80-32d9-47d2-94e4-81c4f7139f4a">
    <name>НомерИГК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb40c87b-9005-456d-b42f-f3b6a887cee5">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cddc38e-54ee-405d-ab65-b99a6675c8d5">
    <name>ПредметКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06d38dba-215d-40b4-8d80-1a415a672df8">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3012a7-a307-43fa-99df-9112aa5d6559">
    <name>ДатаЗаключения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45ba24f8-10ba-476f-9192-af80cb30a623">
    <name>ВнутреннийИдентификаторЕИС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8cdf14cd-5534-4834-8b09-97d008f577ef">
    <name>ТипНаправленияДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПоступлениеДСПоГосконтракту/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПоступлениеДСПоГосконтракту.КАНАТ_ПоступлениеДСПоГосКонтракту");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	ДанныеШапки.Вставить("НачалоПериода", Формат(Период.ДатаНачала,"ДФ=dd.MM.yy"));
	ДанныеШапки.Вставить("КонецПериода", Формат(Период.ДатаОкончания,"ДФ=dd.MM.yy"));
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетНаОплату.Ссылка ЕСТЬ NULL
	|			ТОГДА ПоступлениеБезналичныхДС.ОбъектРасчетов
	|		ИНАЧЕ СчетНаОплату.ДоговорИзСчета
	|	КОНЕЦ КАК ДоговорДляРасчетов,
	|	ПоступлениеБезналичныхДС.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.СуммаПлатежногоПоручения КАК СуммаПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.ВалютаПлатежногоПоручения КАК ВалютаПлатежногоПоручения,
	|	СчетНаОплату.Дата КАК ДатаСчетаНаОплату,
	|	СчетНаОплату.Номер КАК НомерСчетаНаОплату,
	|	СчетНаОплату.СуммаДокумента КАК СуммаСчетаНаОплату,
	|	СчетНаОплату.Валюта КАК ВалютаСчетаНаОплату
	|ПОМЕСТИТЬ ВтСчетовИОплат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа КАК СсылкаДляСвязи,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Номер КАК НомерПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.СуммаДокумента КАК СуммаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК ОбъектРасчетов
	|	ИЗ
	|		Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|	ГДЕ
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1
	|		И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен) КАК ПоступлениеБезналичныхДС
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетНаОплатуКлиенту.Ссылка КАК Ссылка,
	|			СчетНаОплатуКлиенту.Номер КАК Номер,
	|			СчетНаОплатуКлиенту.Дата КАК Дата,
	|			СчетНаОплатуКлиенту.СуммаДокумента КАК СуммаДокумента,
	|			СчетНаОплатуКлиенту.Валюта КАК Валюта,
	|			СчетНаОплатуКлиенту.ДокументОснование КАК ДокументОснование,
	|			СчетНаОплатуКлиенту.Договор КАК ДоговорИзСчета
	|		ИЗ
	|			Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ГДЕ
	|			СчетНаОплатуКлиенту.Проведен) КАК СчетНаОплату
	|		ПО ПоступлениеБезналичныхДС.СсылкаДляСвязи = СчетНаОплату.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Плательщик,
	|	ЕСТЬNULL(ГосударственныеКонтракты.Ссылка, ЗНАЧЕНИЕ(Справочник.ГосударственныеКонтракты.ПустаяСсылка)) КАК Госконтракт,
	|	ЕСТЬNULL(ГосударственныеКонтракты.НомерИГК, """") КАК НомерИГК,
	|	ДоговорыКонтрагентов.Сумма КАК СуммаКонтракта,
	|	ЕСТЬNULL(ВтСчетовИОплат.ДатаСчетаНаОплату, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.НомерСчетаНаОплату, """") КАК НомерСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.СуммаСчетаНаОплату, 0) КАК СуммаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.ВалютаСчетаНаОплату, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.ДатаПлатежногоПоручения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.НомерПлатежногоПоручения, """") КАК НомерПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.СуммаПлатежногоПоручения, 0) КАК СуммаПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.ВалютаПлатежногоПоручения, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаПлатежногоПоручения,
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|		ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСчетовИОплат КАК ВтСчетовИОплат
	|		ПО ДоговорыКонтрагентов.Ссылка = ВтСчетовИОплат.ДоговорДляРасчетов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ
	|	И (ДоговорыКонтрагентов.ДатаНачалаДействия МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ НЕ &ИспользоватьПериод)
	|	И (Контрагенты.Ссылка = &Плательщик
	|			ИЛИ НЕ &ИспользоватьПлательщик)
	|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
	|			ИЛИ НЕ &ИспользоватьГосконтракт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ДатаНачалаДействия
	|ИТОГИ
	|	СУММА(СуммаКонтракта),
	|	СУММА(СуммаСчетаНаОплату),
	|	СУММА(СуммаПлатежногоПоручения)
	|ПО
	|	ОБЩИЕ,
	|	ДоговорыКонтрагентов";
	
	Запрос.УстановитьПараметр("Госконтракт"					,Госконтракт);
	Запрос.УстановитьПараметр("ЗаказКлиента"				,ЗаказКлиента);
	Запрос.УстановитьПараметр("ИспользоватьПериод"			,ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт"		,ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьЗаказКлиента"	,ИспользоватьЗаказКлиента);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик"		,ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода"				,Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода"				,Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик"					,Плательщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаДоговорыКонтрагентов = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговорыКонтрагентов.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДоговорыКонтрагентов
		
		ВыборкаДетальные = ВыборкаДоговорыКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Счетчик = 1;
		Пока ВыборкаДетальные.Следующий() Цикл
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры,ВыборкаДетальные);
			ОбластьСтрокаТаблицы.Параметры.НомерСтроки = Счетчик;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			Счетчик	= Счетчик + 1;
		КонецЦикла;
	КонецЦикла;
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ИтогоСуммаДоговор		= 0;
	//ИтогоСуммаСФ			= 0;
	//ИтогоСуммаРеализации	= 0;
	//Счетчик = 1;
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
	//	
	//	ДанныеСтроки = Новый Структура;
	//	ДанныеСтроки.Вставить("ПП",             Счетчик);
	//	ДанныеСтроки.Вставить("Номер",          Выборка.Номер);
	//	ДанныеСтроки.Вставить("Дата",           Выборка.Дата);
	//	ДанныеСтроки.Вставить("Плательщик",     Выборка.Плательщик);
	//	ДанныеСтроки.Вставить("СуммаКонтракта", Выборка.СуммаКонтракта);
	//	ДанныеСтроки.Вставить("СуммаСФ",        Выборка.СуммаПоСчетуФактуре);
	//	ДанныеСтроки.Вставить("Госконтракт",    Выборка.Представление);
	//	ДанныеСтроки.Вставить("ИГК",            Выборка.НомерИГК);
	//	ДанныеСтроки.Вставить("НомерРеализации",Выборка.НомерРеализации);
	//	ДанныеСтроки.Вставить("ДатаРеализации", Формат(Выборка.ДатаРеализации,"ДФ=dd.MM.yyyy"));
	//	ДанныеСтроки.Вставить("СуммаРеализации",Выборка.СуммаРеализации);
	//	
	//	ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтроки);
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	//	
	//	Счетчик					= Счетчик + 1;
	//	ИтогоСуммаДоговор		= ИтогоСуммаДоговор + Выборка.СуммаКонтракта;
	//	ИтогоСуммаСФ			= ИтогоСуммаСФ + Выборка.СуммаПоСчетуФактуре;
	//	ИтогоСуммаРеализации	= ИтогоСуммаРеализации+ Выборка.СуммаРеализации;
	//КонецЦикла;
	
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ЗаполнитьЗначенияСвойств(ОбластьТаблицаПодвал.Параметры,ВыборкаОбщийИтог);
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	ДанныеПодвал.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ДанныеПодвал.Вставить("Дата", ТекущаяДата());
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Справочники.ГосударственныеКонтракты.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьЗаказКлиента Тогда
		Элементы.ЗаказКлиента.Доступность = Истина;
	Иначе
		Плательщик = Документы.ЗаказКлиента.ПустаяСсылка();
		Элементы.ЗаказКлиента.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказКлиентаПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры
